## Plan Result (sbox-network)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.vnet_peer_hub_sbox.azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_hub_sbox.azurerm_virtual_network_peering.target_to_initiator
* Delete
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.target_to_initiator
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.initiator_to_target




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vnet_peer_hub_sbox.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hubUkS"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name          = "cft-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "cft-sbox-vnet"
    }

  # module.vnet_peer_hub_sbox.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "cftsbox"
      + remote_virtual_network_id    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet"
      + resource_group_name          = "hmcts-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "hmcts-hub-sbox-int"
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.initiator_to_target will be destroyed
  # (because module.vnet_peer_hub_sbox["ukSouth"] is not in configuration)
  - resource "azurerm_virtual_network_peering" "initiator_to_target" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/virtualNetworkPeerings/hubUkS" -> null
      - name                         = "hubUkS" -> null
      - remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int" -> null
      - resource_group_name          = "cft-sbox-network-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "cft-sbox-vnet" -> null
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.target_to_initiator will be destroyed
  # (because module.vnet_peer_hub_sbox["ukSouth"] is not in configuration)
  - resource "azurerm_virtual_network_peering" "target_to_initiator" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int/virtualNetworkPeerings/cftsbox" -> null
      - name                         = "cftsbox" -> null
      - remote_virtual_network_id    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet" -> null
      - resource_group_name          = "hmcts-hub-sbox-int" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "hmcts-hub-sbox-int" -> null
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.initiator_to_target will be destroyed
  # (because module.vnet_peer_hub_sbox["ukWest"] is not in configuration)
  - resource "azurerm_virtual_network_peering" "initiator_to_target" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/virtualNetworkPeerings/hubUkW" -> null
      - name                         = "hubUkW" -> null
      - remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/ukw-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/ukw-hub-sbox-int" -> null
      - resource_group_name          = "cft-sbox-network-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "cft-sbox-vnet" -> null
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":477,"Program":"tfcmt","SHA1":"","Target":"sbox-network","Vars":{}} -->